tarotia/app/views/categories/index.html.erb

            <span class="material-symbols-outlined text-[14px] text-<%= theme[:color] %>">auto_stories</span>
            <span class="font-label-mono text-label-mono text-on-surface-variant"><%= category.subcategories.count %></span>
---
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "subcategories" WHERE "subcategories"."category_id" = 1