tarotia/app/views/subcategories/show.html.erb

SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = 53
---
        <div class="space-y-3">
          <% @category.subcategories.each do |sub| %>