tarotia/app/controllers/auth_controller.rb

INSERT INTO "users" ("name", "email", "plan", "password_digest", "created_at", "updated_at") VALUES ('iacomunia', 'iacomunia@gmail.com', 'PRO', '$2a$12$Ep2dyv6NDxGgarz9WohIh.DdgvLmiPliFxU/0tCM8WJPWpjxlIJN2', '2026-05-15 22:16:57.538286', '2026-05-15 22:16:57.538286') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'iaocmunia@gmail.com' LIMIT 1
---
  def create
    if params[:name].present?
      user = User.new(name: params[:name], email: params[:email], password: params[:password], plan: 'PRO')
      if user.save
        session[:user_id] = user.id
        redirect_to root_path, notice: 'Cuenta creada exitosamente'
      else
        flash.now[:alert] = user.errors.full_messages.to_sentence
        render params[:name].present? ? :registro : :login
      end
    else
      user = User.find_by(email: params[:email])