tarotia/app/controllers/subcategories_controller.rb

  def show
    @category = Category.find_by!(slug: params[:category_slug])
    @subcategory = @category.subcategories.find_by!(slug: params[:slug])
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'lecturas-de-tarot' LIMIT 1
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = 2 AND "subcategories"."slug" = 'lectura-general' LIMIT 1